Kmeans

In [1]:
import os
import numpy as np
import pandas as pd
import plotly.graph_objects as go
import sys

from sklearn import preprocessing

In [75]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

In [17]:
np.iinfo(np.int8).max - np.iinfo(np.int8).min

255

In [21]:
df = pd.DataFrame({"age":[22,21,23,33,35,33,33,55],
                   "country":["Korea", "Canada", "Canada", "Korea",
                              "Korea", "Korea", "Canada", "Singapore"] 
                  })

In [31]:
"float".contains("f")

AttributeError: 'str' object has no attribute 'contains'

In [35]:
np.finfo(np.float16).max - np.finfo(np.float16).min

C:\Users\haneu\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: overflow encountered in half_scalars
  """Entry point for launching an IPython kernel.

inf

In [22]:
df.head()

   age country
0   22   Korea
1   21  Canada
2   23  Canada
3   33   Korea
4   35   Korea

In [30]:
df.astype({"age":"int16"})

   age    country
0   22      Korea
1   21     Canada
2   23     Canada
3   33      Korea
4   35      Korea
5   33      Korea
6   33     Canada
7   55  Singapore

In [27]:
df.nunique()

age        6
country    3
dtype: int64

In [29]:
df['country'].nunique()

3

In [11]:
folder_path = '../datasets/h&m'
customer_df = pd.read_parquet(os.path.join(folder_path, "customers.parquet"))

In [13]:
customer_df.head()

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age,postal_code
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,NaN,NaN,ACTIVE,NONE,49.0,52043ee2162cf5aa7ee79974281641c6f11a68d276429a...
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,NaN,NaN,ACTIVE,NONE,25.0,2973abc54daa8a5f8ccfe9362140c63247c5eee03f1d93...
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,NaN,NaN,ACTIVE,NONE,24.0,64f17e6a330a85798e4998f62d0930d14db8db1c054af6...
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,NaN,NaN,ACTIVE,NONE,54.0,5d36574f52495e81f019b680c843c443bd343d5ca5b1c2...
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1.0,1.0,ACTIVE,Regularly,52.0,25fa5ddee9aac01b35208d01736e57942317d756b32ddd...

In [35]:
customer_df.select_dtypes(include=["integer", "float"]).describe()

             FN    Active           age
count  476930.0  464404.0  1.356119e+06
mean        1.0       1.0  3.638696e+01
std         0.0       0.0  1.431363e+01
min         1.0       1.0  1.600000e+01
25%         1.0       1.0  2.400000e+01
50%         1.0       1.0  3.200000e+01
75%         1.0       1.0  4.900000e+01
max         1.0       1.0  9.900000e+01

In [49]:
customer_df.select_dtypes(include=["integer", "float"]).describe()["FN"][["min", "max"]]

min    1.0
max    1.0
Name: FN, dtype: float64

In [58]:
_min = 100
_max = 200

_max - _min

100

In [53]:
customer_df.select_dtypes(include=["object"]).columns

Index(['customer_id', 'club_member_status', 'fashion_news_frequency',
       'postal_code'],
      dtype='object')

In [31]:
customer_df.dtypes

customer_id                object
FN                        float64
Active                    float64
club_member_status         object
fashion_news_frequency     object
age                       float64
postal_code                object
dtype: object

In [17]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1371980 entries, 0 to 1371979
Data columns (total 7 columns):
 #   Column                  Non-Null Count    Dtype
---  ------                  --------------    -----
 0   customer_id             1371980 non-null  object
 1   FN                      476930 non-null   float64
 2   Active                  464404 non-null   float64
 3   club_member_status      1365918 non-null  object
 4   fashion_news_frequency  1355971 non-null  object
 5   age                     1356119 non-null  float64
 6   postal_code             1371980 non-null  object
dtypes: float64(3), object(4)
memory usage: 73.3+ MB

In [ ]:
dtypes_to_check = ["string", "float", "int"]
customer_df

In [16]:
customer_df.select_dtypes("object")

,customer_id,club_member_status,fashion_news_frequency,postal_code
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,ACTIVE,NONE,52043ee2162cf5aa7ee79974281641c6f11a68d276429a...
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,ACTIVE,NONE,2973abc54daa8a5f8ccfe9362140c63247c5eee03f1d93...
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,ACTIVE,NONE,64f17e6a330a85798e4998f62d0930d14db8db1c054af6...
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,ACTIVE,NONE,5d36574f52495e81f019b680c843c443bd343d5ca5b1c2...
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,ACTIVE,Regularly,25fa5ddee9aac01b35208d01736e57942317d756b32ddd...
...,...,...,...,...
1371975,ffffbbf78b6eaac697a8a5dfbfd2bfa8113ee5b403e474...,ACTIVE,NONE,7aa399f7e669990daba2d92c577b52237380662f36480b...
1371976,ffffcd5046a6143d29a04fb8c424ce494a76e5cdf4fab5...,ACTIVE,NONE,3f47f1279beb72215f4de557d950e0bfa73789d24acb5e...
1371977,ffffcf35913a0bee60e8741cb2b4e78b8a98ee5ff2e6a1...,ACTIVE,Regularly,4563fc79215672cd6a863f2b4bf56b8f898f2d96ed590e...
1371978,ffffd7744cebcf3aca44ae7049d2a94b87074c3d4ffe38...,ACTIVE,Regularly,8892c18e9bc3dca6aa4000cb8094fc4b51ee8db2ed14d7...
1371979,ffffd9ac14e89946416d80e791d064701994755c3ab686...,PRE-CREATE,NONE,0a1a03306fb2f62164c2a439b38c0caa64b40deaae8687...

In [14]:
customer_df.dtypes

customer_id                object
FN                        float64
Active                    float64
club_member_status         object
fashion_news_frequency     object
age                       float64
postal_code                object
dtype: object

In [3]:
# TODO: Need to make this process dynamic, given dataset we need to figure out its dtypes then
# apply appropriate preprocessing steps.

df.dtypes

age         int64
country    object
dtype: object

In [8]:
# TODO: should use correct numpy array types for maximum efficieny
df.to_numpy()

array([[22, 'Korea'],
       [21, 'Canada'],
       [23, 'Canada'],
       [33, 'Korea'],
       [35, 'Korea'],
       [33, 'Korea'],
       [33, 'Canada'],
       [55, 'Singapore']], dtype=object)

In [6]:
df.select_dtypes("int")

   age
0   22
1   21
2   23
3   33
4   35
5   33
6   33
7   55

In [4]:
df.describe()

             age
count   8.000000
mean   31.875000
std    10.973182
min    21.000000
25%    22.750000
50%    33.000000
75%    33.500000
max    55.000000

In [3]:
le = preprocessing.LabelEncoder()
df['country'] = le.fit_transform(df['country'])
# df = df.reset_index().rename(columns={"index":"user_id"})

In [4]:
country_le_map = dict(zip(le.classes_, le.transform(le.classes_)))

In [5]:
df.head()

   age  country
0   22        1
1   21        0
2   23        0
3   33        1
4   35        1

In [20]:
fig = go.Figure()

fig.add_trace(
    go.Scatter(
        x = df['age'],
        y = df['country'],
        mode='markers'
    )
)

fig.show()

In [17]:
"""
K-means clustering implementation

1. choose random k-points
2. calculate distance from k-point and all other values.

"""

In [13]:
from sklearn.cluster import KMeans
X = df.values
kmeans = KMeans(n_clusters=3, n_init=10)
kmeans.fit(X)
df['cluster'] = kmeans.predict(X)

In [ ]:
fig = go.Figure()

fig.add_trace(
    go.Scatter(
        x = df['age'],
        y = df['country'],
        mode='markers',
        marker=dict(color=df['cluster'])
    )
)

fig.show()

In [15]:
df

   age  country  cluster
0   22        1        1
1   21        0        1
2   23        0        1
3   33        1        0
4   35        1        0
5   33        1        0
6   33        0        0
7   55        2        2